Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_vendor.h
/*
 * Copyright(c) 2007 - 2018 Realtek Corporation. All rights reserved.
 * SPDX-License-Identifier: Apache-2.0
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @file     rtl8735b_vendor.h
 * @brief    CMSIS HeaderFile
 * @version  1.0
 * @date     13. December 2018
 * @note     Generated by SVDConv V3.3.13 on Thursday, 13.12.2018 15:07:46
 *           from File 'rtl8735b_vendor.svd',
 *           last modified on Thursday, 13.12.2018 07:07:16
 */




/** @addtogroup hs_hal_vendor Vendor Function
  * @ingroup 8735b_hal
  * @{
  */


#ifndef RTL8735B_VENDOR_H
#define RTL8735B_VENDOR_H

#ifdef __cplusplus
extern "C" {
#endif


/// @cond DOXYGEN_VDR_REG_TYPE

/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
#pragma push
#pragma anon_unions
#elif defined (__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
#pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
/* anonymous unions are enabled by default */
#elif defined (__TMS470__)
/* anonymous unions are enabled by default */
#elif defined (__TASKING__)
#pragma warning 586
#elif defined (__CSMC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup vendor_peripherals Vendor Function Registers
  * @ingroup hs_hal_vendor
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            VDR                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Vendor Registers (VDR)
  */

typedef struct {                                /*!< (@ 0x40002800) VDR Structure                                              */

	union {
		__IOM uint32_t watch_dog_timer;             /*!< (@ 0x00000000) Watch Dog Timer Control Register                           */

		struct {
			__IOM uint32_t vndr_divfactor : 16;       /*!< [15..0] Dividing factor. Watch dog timer is count with 64KHz/(divfactor+1).
                                                     Minimum dividing factor is 1.                                             */
			__IOM uint32_t wdt_en_byte : 8;           /*!< [23..16] Set 0xA5 to enable watch dog timer                               */
			__OM  uint32_t wdt_clear  : 1;            /*!< [24..24] Write 1 to clear timer                                           */
			__IOM uint32_t cnt_limit  : 4;            /*!< [28..25] 0: 0x001 1: 0x003 2: 0x007 3: 0x00F 4: 0x01F 5: 0x03F
                                                     6: 0x07F 7: 0x0FF 8: 0x1FF 9: 0x3FF 10: 0x7FF 11~15: 0xFFF                */
			__IM  uint32_t            : 1;
			__IOM uint32_t wdt_mode   : 1;            /*!< [30..30] 1: Reset system, 0: Interrupt CPU                                */
			__IOM uint32_t wdt_to     : 1;            /*!< [31..31] Watch dog timer timeout. 1 cycle pulse, Write 1 to
                                                     clear.                                                                    */
		} watch_dog_timer_b;
	} ;

	union {
		__IOM uint32_t low_pri_int_mode;            /*!< (@ 0x00000004) Low Priority Interrupt Trigger Mode Control Register       */

		struct {
			__IOM uint32_t low_pri_int0_mode : 1;     /*!< [0..0] Each bit control corresponding interrupt mode. 1: Rising
                                                     edge trigger 0: High level active                                         */
			__IOM uint32_t low_pri_int1_mode : 1;     /*!< [1..1] Each bit control corresponding interrupt mode. 1: Rising
                                                     edge trigger 0: High level active                                         */
			__IOM uint32_t low_pri_int2_mode : 1;     /*!< [2..2] Each bit control corresponding interrupt mode. 1: Rising
                                                     edge trigger 0: High level active                                         */
			__IOM uint32_t low_pri_int13_mode : 1;    /*!< [3..3] Each bit control corresponding interrupt mode. 1: Rising
                                                     edge trigger 0: High level active                                         */
			__IOM uint32_t low_pri_int4_mode : 1;     /*!< [4..4] Each bit control corresponding interrupt mode. 1: Rising
                                                     edge trigger 0: High level active                                         */
		} low_pri_int_mode_b;
	} ;

	union {
		__IOM uint32_t low_pri_int_imr;             /*!< (@ 0x00000008) Low Priority Interrupt Mask Register                       */

		struct {
			__IOM uint32_t rxi_300_en : 1;            /*!< [0..0] Each bit enable corresponding interrupt. 1: Enable 0:
                                                     Disable                                                                   */
			__IOM uint32_t spic_int_en : 1;           /*!< [1..1] Each bit enable corresponding interrupt. 1: Enable 0:
                                                     Disable                                                                   */
			__IOM uint32_t psrm_cal_fail_int_en : 1;  /*!< [2..2] Each bit enable corresponding interrupt. 1: Enable 0:
                                                     Disable                                                                   */
			__IOM uint32_t psrm_time_out_int_en : 1;  /*!< [3..3] Each bit enable corresponding interrupt. 1: Enable 0:
                                                     Disable                                                                   */
			__IOM uint32_t scorebord_int_en : 1;      /*!< [4..4] Each bit enable corresponding interrupt. 1: Enable 0:
                                                     Disable                                                                   */
		} low_pri_int_imr_b;
	} ;

	union {
		__IOM uint32_t low_pri_int_isr;             /*!< (@ 0x0000000C) Low Priority Interrupt Pending Status Register             */

