Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_vendor.h
		struct {
			__IOM uint32_t rxi_300_int : 1;           /*!< [0..0] RXI300 bus interrupt status. Write 1 clear.                        */
			__IOM uint32_t spic_int   : 1;            /*!< [1..1] SPIC interrupt status, Write 1 clear.                              */
			__IOM uint32_t psrm_cal_fail_int : 1;     /*!< [2..2] PSRAM calibration fail interrupt status. Write 1 clear.            */
			__IOM uint32_t psrm_time_out_int : 1;     /*!< [3..3] PSRAM calibration timeout interrupt status. Write 1 clear.         */
			__IM  uint32_t scoreboard_int : 1;        /*!< [4..4] Scoreboard interrupt status                                        */
		} low_pri_int_isr_b;
	} ;
	__IM  uint32_t  RESERVED[3];

	union {
		__IOM uint32_t anack_ctrl;                  /*!< (@ 0x0000001C) ANA Clock Control Register                                 */

		struct {
			__IOM uint32_t anack_rpt  : 16;           /*!< [15..0] The calculation value of ANA clock where the reference
                                                     clock is 40MHz.                                                           */
			__IM  uint32_t            : 8;
			__IOM uint32_t anack_sel  : 2;            /*!< [25..24] 00: Calculation of 4M for 32 cycles (for debug use)
                                                     01: Calculation of 128K for 8 cycles 10: Rsvd 11: Rsvd                    */
			__IM  uint32_t            : 5;
			__IOM uint32_t anack_cmd  : 1;            /*!< [31..31] 1: Enable ANACK calculation and indicate busy when
                                                     the calculation process is on-going. 0: Calculation is
                                                     done. Set as 0 by HW when calibration is done.                            */
		} anack_ctrl_b;
	} ;

	union {
		__IOM uint32_t data_fifo_swap_ctrl;         /*!< (@ 0x00000020) FIFO Data Swap Control Register                            */

		struct {
			__IOM uint32_t i2c0_tx_bit_swap_en : 1;   /*!< [0..0] I2C TX bits swap enable                                            */
			__IOM uint32_t i2c0_rx_bit_swap_en : 1;   /*!< [1..1] I2C RX bits swap enable                                            */
		} data_fifo_swap_ctrl_b;
	} ;
	__IM  uint32_t  RESERVED1[3];

	union {
		__IM  uint32_t gdma0_isr;            /*!< (@ 0x00000030) Non-Secure GDMA Interrupt Pending Status Register              */

		struct {
			__IM  uint32_t gdma0_ch0_isr : 1;         /*!< [0..0] Non-Secure GDMA 0 channel 0 interrupt pending status                     */
			__IM  uint32_t gdma0_ch1_isr : 1;         /*!< [1..1] Non-Secure GDMA 0 channel 1 interrupt pending status                     */
			__IM  uint32_t gdma0_ch2_isr : 1;         /*!< [2..2] Non-Secure GDMA 0 channel 2 interrupt pending status                     */
			__IM  uint32_t gdma0_ch3_isr : 1;         /*!< [3..3] Non-Secure GDMA 0 channel 3 interrupt pending status                     */
			__IM  uint32_t gdma0_ch4_isr : 1;         /*!< [4..4] Non-Secure GDMA 0 channel 4 interrupt pending status                     */
			__IM  uint32_t gdma0_ch5_isr : 1;         /*!< [5..5] Non-Secure GDMA 0 channel 5 interrupt pending status                     */
		} gdma0_isr_b;
	} ;

	union {
		__IM  uint32_t gdma1_isr;            /*!< (@ 0x00000034) Non-Secure GDMA Interrupt Pending Status Register              */

		struct {
			__IM  uint32_t gdma1_ch0_isr : 1;         /*!< [0..0] Non-Secure GDMA 1 channel 0 interrupt pending status                     */
			__IM  uint32_t gdma1_ch1_isr : 1;         /*!< [1..1] Non-Secure GDMA 1 channel 1 interrupt pending status                     */
			__IM  uint32_t gdma1_ch2_isr : 1;         /*!< [2..2] Non-Secure GDMA 1 channel 2 interrupt pending status                     */
			__IM  uint32_t gdma1_ch3_isr : 1;         /*!< [3..3] Non-Secure GDMA 1 channel 3 interrupt pending status                     */
			__IM  uint32_t gdma1_ch4_isr : 1;         /*!< [4..4] Non-Secure GDMA 1 channel 4 interrupt pending status                     */
			__IM  uint32_t gdma1_ch5_isr : 1;         /*!< [5..5] Non-Secure GDMA 1 channel 5 interrupt pending status                     */
		} gdma1_isr_b;
	} ;

	union {
		__IM  uint32_t wl_isr;                      /*!< (@ 0x00000038) WLAN Interrupt Pending Status Register                     */

		struct {
			__IM  uint32_t wlan_page0_int : 1;        /*!< [0..0] Wlan Page0 Interrupt pending status.                               */
			__IM  uint32_t ahb_local_int : 1;         /*!< [1..1] WL page3 interrupt pending status                                  */
		} wl_isr_b;
	} ;
	__IM  uint32_t  RESERVED2;

	union {
		__IOM uint32_t mbist_ctrl;                  /*!< (@ 0x00000040) MBIST Control Register                                     */

		struct {
			__IOM uint32_t mbist_clk_en : 1;          /*!< [0..0] bit mbist clock enable.                                            */
			__IOM uint32_t mbist_rstn : 1;            /*!< [1..1] mbist enable for each mbist group                                  */
			__IOM uint32_t mbist_msel : 2;            /*!< [3..2] mbist mode select, 2'b01, 2'b11---> nrml mode enalbe,
                                                     2'b10, 2'b11 -->drf mode enable                                           */
			__IOM uint32_t mbist_resume : 1;          /*!< [4..4] resume mbist drf test                                              */
			__IOM uint32_t mbist_dyn_rden : 1;        /*!< [5..5] dynamic vdd enable                                                 */
			__IOM uint32_t mbist_resume_ps : 1;       /*!< [6..6] resume mbist ps test                                               */
			__IM  uint32_t            : 1;
			__IOM uint32_t mbist_rom_rpt_sel0 : 3;    /*!< [10..8] select mbist rom report result                                    */
		} mbist_ctrl_b;
	} ;

	union {
		__IOM uint32_t mbist_func_en_ctrl;          /*!< (@ 0x00000044) MBIST Function Enable Control Register                     */

		struct {
			__IOM uint32_t mbist_fen_cpu_bt : 1;      /*!< [0..0] enable mbist for BT CPU                                            */
			__IOM uint32_t mbist_fen_128x12x4 : 1;    /*!< [1..1] enable mbist for 128x12x4                                          */
			__IOM uint32_t mbist_fen_512x16_bt : 1;   /*!< [2..2] enable mbist for 512x16 BT                                         */
			__IOM uint32_t mbist_fen_128x16_bt : 1;   /*!< [3..3] enable mbist for 128x16 BT                                         */
			__IOM uint32_t mbist_fen_288x32_bt : 1;   /*!< [4..4] enable mbist for 288x32 BT                                         */
			__IOM uint32_t mbist_fen_03 : 1;          /*!< [5..5] enable mbist 3                                                     */
			__IOM uint32_t mbist_fen_06 : 1;          /*!< [6..6] enable mbist 6                                                     */
			__IOM uint32_t mbist_fen_07 : 1;          /*!< [7..7] enable mbist for mbist_07, mbist_09                                */
			__IM  uint32_t            : 1;
			__IOM uint32_t mbist_fen_11 : 1;          /*!< [9..9] enable mbist for mbist_11, mbist_12                                */
			__IM  uint32_t            : 1;
			__IOM uint32_t mbist_fen_13 : 1;          /*!< [11..11] enable mbist for mbist_13, mbist_18, mbist_19                    */
			__IOM uint32_t mbist_fen_17 : 1;          /*!< [12..12] enable mbist 17                                                  */
			__IM  uint32_t            : 2;
			__IOM uint32_t mbist_fen_rx2_icache : 1;  /*!< [15..15] enable mbist for RX to I-Cache                                   */
			__IOM uint32_t mbist_fen_rx2_dcache : 1;  /*!< [16..16] enable mbist for RX to D-cache                                   */
			__IOM uint32_t mbist_fen_rx2_dtcm : 1;    /*!< [17..17] enable mbist for RX to DTCM                                      */
			__IOM uint32_t mbist_fen_wmac_e0_dc : 1;  /*!< [18..18] enable mbist for wmac_e0 DC                                      */
			__IOM uint32_t mbist_fen_wmac_e1_dc : 1;  /*!< [19..19] enable mbist for wmac_e1 DC                                      */
			__IOM uint32_t mbist_fen_wpon_e0_dc : 1;  /*!< [20..20] enable mbist for wpon_e0_dc                                      */
			__IOM uint32_t mbist_fen_wpon_e1_dc : 1;  /*!< [21..21] enable mbist for wpon_e1_dc                                      */
			__IOM uint32_t mbist_fen_sdio : 1;        /*!< [22..22] enable mbist for SDIO                                            */
			__IOM uint32_t mbiist_fen_share : 1;      /*!< [23..23] enable mbist for share                                           */
			__IOM uint32_t mbist_fen_rom32kx32 : 1;   /*!< [24..24] enable mbist for 32K x 32                                        */
			__IOM uint32_t mbist_fen_rx2_itcm : 1;    /*!< [25..25] enable mbist for rx to ITCM                                      */
			__IOM uint32_t mbist_fen_wmac_e2_dc : 1;  /*!< [26..26] enable mbist for wmac_e2_dc                                      */
		} mbist_func_en_ctrl_b;
	} ;

	union {
		__IM  uint32_t mbist_sta;                   /*!< (@ 0x00000048) MBIST Status Register                                      */

