Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_vendor.h
		struct {
			__IM  uint32_t mbist_drf_fail : 1;        /*!< [0..0] mbist test status :drf_fail                                        */
			__IM  uint32_t mbist_drf_done : 1;        /*!< [1..1] mbist test status: drf_done                                        */
			__IM  uint32_t mbist_nrml_fail : 1;       /*!< [2..2] mbist test status : normal failed                                  */
			__IM  uint32_t mbist_nrml_done : 1;       /*!< [3..3] mbist test status: normal done                                     */
			__IM  uint32_t mbist_start_pause : 1;     /*!< [4..4] mbist test status :start/pause                                     */
		} mbist_sta_b;
	} ;

	union {
		__IM  uint32_t mbist_done;                  /*!< (@ 0x0000004C) MBIST Done Output Register                                 */

		struct {
			__IM  uint32_t data       : 32;           /*!< [31..0] mbist_done                                                        */
		} mbist_done_b;
	} ;

	union {
		__IM  uint32_t mbist_fail_nrml0;            /*!< (@ 0x00000050) MBIST Fail Normal Output Register0                         */

		struct {
			__IM  uint32_t data       : 32;           /*!< [31..0] mbist_fail_nrml0                                                  */
		} mbist_fail_nrml0_b;
	} ;

	union {
		__IM  uint32_t mbist_fail_nrml1;            /*!< (@ 0x00000054) MBIST Fail Normal Output Register1                         */

		struct {
			__IM  uint32_t data       : 32;           /*!< [31..0] mbist_fail_nrml1                                                  */
		} mbist_fail_nrml1_b;
	} ;

	union {
		__IM  uint32_t mbist_fail_nrml2;            /*!< (@ 0x00000058) MBIST Fail Normal Output Register2                         */

		struct {
			__IM  uint32_t dara       : 32;           /*!< [31..0] mbist_fail_nrml2                                                  */
		} mbist_fail_nrml2_b;
	} ;

	union {
		__IM  uint32_t mbist_fail_drf0;             /*!< (@ 0x0000005C) MBIST Fail DRF Output Register0                            */

		struct {
			__IM  uint32_t data       : 32;           /*!< [31..0] mbist_fail_drf0                                                   */
		} mbist_fail_drf0_b;
	} ;

	union {
		__IM  uint32_t mbist_fail_drf1;             /*!< (@ 0x00000060) MBIST Fail DRF Output Register1                            */

		struct {
			__IM  uint32_t data       : 32;           /*!< [31..0] mbist_fail_drf1                                                   */
		} mbist_fail_drf1_b;
	} ;

	union {
		__IM  uint32_t mbist_fail_drf2;             /*!< (@ 0x00000064) MBIST Fail DRF Output Register2                            */

		struct {
			__IM  uint32_t data       : 32;           /*!< [31..0] mbist_fail_drf2                                                   */
		} mbist_fail_drf2_b;
	} ;

	union {
		__IM  uint32_t mbist_start_pause0;          /*!< (@ 0x00000068) MBIST Start Pause Output Register0                         */

		struct {
			__IM  uint32_t data       : 32;           /*!< [31..0] mbist_start_pause0                                                */
		} mbist_start_pause0_b;
	} ;

	union {
		__IM  uint32_t mbist_start_pause1;          /*!< (@ 0x0000006C) MBIST Start Pause Output Register1                         */

		struct {
			__IM  uint32_t data       : 32;           /*!< [31..0] mbist_start_pause1                                                */
		} mbist_start_pause1_b;
	} ;

	union {
		__IM  uint32_t mbist_start_pause2;          /*!< (@ 0x00000070) MBIST Start Pause Output Register2                         */

		struct {
			__IM  uint32_t data       : 32;           /*!< [31..0] mbist_start_pause2                                                */
		} mbist_start_pause2_b;
	} ;
	__IM  uint32_t  RESERVED3;

	union {
		__IM  uint32_t mbist_rom_misr_dout_l;       /*!< (@ 0x00000078) MBIST ROM MISR Data Output Low Register                    */

		struct {
			__IM  uint32_t data       : 32;           /*!< [31..0] rom_misr_dout[31:0] of memory misr                                */
		} mbist_rom_misr_dout_l_b;
	} ;

	union {
		__IM  uint32_t mbist_rom_misr_dout_h;       /*!< (@ 0x0000007C) MBIST ROM MISR Data Output High Register                   */

		struct {
			__IM  uint32_t data       : 32;           /*!< [31..0] rom_misr_dout[63:32] of memory misr                               */
		} mbist_rom_misr_dout_h_b;
	} ;
} VDR_Type;                                     /*!< Size = 128 (0x80)                                                         */



/* =========================================================================================================================== */
/* ================                                           VDR_S                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Vendor Registers (VDR_S)
  */

typedef struct {                                /*!< (@ 0x50002C00) VDR_S Structure                                            */

	union {
		__IOM uint32_t sec_low_pri_int_mode;        /*!< (@ 0x00000000) Secure Low Priority Interrupt Trigger Mode Control
                                                                    Register                                                   */

		struct {
			__IOM uint32_t sec_low_pri_int0_mode : 1; /*!< [0..0] Each bit control corresponding interrupt mode. 1: Rising
                                                     edge trigger 0: High level active                                         */
		} sec_low_pri_int_mode_b;
	} ;

	union {
		__IOM uint32_t sec_low_pri_int_imr;         /*!< (@ 0x00000004) Secure Low Priority Interrupt Mask Register                */

		struct {
			__IOM uint32_t rxi300_int_imr : 1;        /*!< [0..0] 1: Enable 0: Disable                                               */
		} sec_low_pri_int_imr_b;
	} ;

	union {
		__IOM uint32_t secure_low_pri_int_isr;      /*!< (@ 0x00000008) Secure Low Priority Interrupt Pending Status
                                                                    Register                                                   */

