Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_vendor.h
		struct {
			__IOM uint32_t rxi300_secure_bus_isr : 1; /*!< [0..0] RXI300 secure bus interrupt pending status. Wite 1 clear.          */
		} secure_low_pri_int_isr_b;
	} ;

	union {
		__IM  uint32_t gdma0_isr;            /*!< (@ 0x0000000C) Secure GDMA Interrupt Pending Status Register              */

		struct {
			__IM  uint32_t gdma0_ch0_isr : 1;         /*!< [0..0] Secure GDMA 0 channel 0 interrupt pending status                     */
			__IM  uint32_t gdma0_ch1_isr : 1;         /*!< [1..1] Secure GDMA 0 channel 1 interrupt pending status                     */
			__IM  uint32_t gdma0_ch2_isr : 1;         /*!< [2..2] Secure GDMA 0 channel 2 interrupt pending status                     */
			__IM  uint32_t gdma0_ch3_isr : 1;         /*!< [3..3] Secure GDMA 0 channel 3 interrupt pending status                     */
			__IM  uint32_t gdma0_ch4_isr : 1;         /*!< [4..4] Secure GDMA 0 channel 4 interrupt pending status                     */
			__IM  uint32_t gdma0_ch5_isr : 1;         /*!< [5..5] Secure GDMA 0 channel 5 interrupt pending status                     */
		} gdma0_isr_b;
	} ;

	union {
		__IM  uint32_t gdma1_isr;            /*!< (@ 0x00000010) Secure GDMA Interrupt Pending Status Register              */

		struct {
			__IM  uint32_t gdma1_ch0_isr : 1;         /*!< [0..0] Secure GDMA 1 channel 0 interrupt pending status                     */
			__IM  uint32_t gdma1_ch1_isr : 1;         /*!< [1..1] Secure GDMA 1 channel 1 interrupt pending status                     */
			__IM  uint32_t gdma1_ch2_isr : 1;         /*!< [2..2] Secure GDMA 1 channel 2 interrupt pending status                     */
			__IM  uint32_t gdma1_ch3_isr : 1;         /*!< [3..3] Secure GDMA 1 channel 3 interrupt pending status                     */
			__IM  uint32_t gdma1_ch4_isr : 1;         /*!< [4..4] Secure GDMA 1 channel 4 interrupt pending status                     */
			__IM  uint32_t gdma1_ch5_isr : 1;         /*!< [5..5] Secure GDMA 1 channel 5 interrupt pending status                     */
		} gdma1_isr_b;
	} ;
	__IM  uint32_t  RESERVED1[3];

	union {
		__OM  uint32_t super_sec_ef_ctrl;           /*!< (@ 0x00000020) Super Secure eFuse Control Register                        */

		struct {
			__OM  uint32_t sec_super_sec_ef_lock : 1; /*!< [0..0] When this bit is written to '1', this bit can not be
                                                     written to '0'. Beside the high speed platform is reset.
                                                     1: Super secure zone can not be accessed. 0: Super secure
                                                     zone just can be accessed by secure state. (AXI_PORT[1]
                                                     = 0)                                                                      */
		} super_sec_ef_ctrl_b;
	} ;
	__IM  uint32_t  RESERVED2[3];

	union {
		__OM  uint32_t non_fixed_secure_key0;       /*!< (@ 0x00000030) Non-Fixed Secure Key Register0                             */

		struct {
			__OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
		} non_fixed_secure_key0_b;
	} ;

	union {
		__OM  uint32_t non_fixed_secure_key1;       /*!< (@ 0x00000034) Non-Fixed Secure Key Register1                             */

		struct {
			__OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
		} non_fixed_secure_key1_b;
	} ;

	union {
		__OM  uint32_t non_fixed_secure_key2;       /*!< (@ 0x00000038) Non-Fixed Secure Key Register2                             */

		struct {
			__OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
		} non_fixed_secure_key2_b;
	} ;

	union {
		__OM  uint32_t non_fixed_secure_key3;       /*!< (@ 0x0000003C) Non-Fixed Secure Key Register3                             */

		struct {
			__OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
		} non_fixed_secure_key3_b;
	} ;

	union {
		__OM  uint32_t non_fixed_secure_key4;       /*!< (@ 0x00000040) Non-Fixed Secure Key Register4                             */

		struct {
			__OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
		} non_fixed_secure_key4_b;
	} ;

	union {
		__OM  uint32_t non_fixed_secure_key5;       /*!< (@ 0x00000044) Non-Fixed Secure Key Register5                             */

		struct {
			__OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
		} non_fixed_secure_key5_b;
	} ;

	union {
		__OM  uint32_t non_fixed_secure_key6;       /*!< (@ 0x00000048) Non-Fixed Secure Key Register6                             */

		struct {
			__OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
		} non_fixed_secure_key6_b;
	} ;

	union {
		__OM  uint32_t non_fixed_secure_key7;       /*!< (@ 0x0000004C) Non-Fixed Secure Key Register7                             */

		struct {
			__OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
		} non_fixed_secure_key7_b;
	} ;

	union {
		__OM  uint32_t non_fixed_non_secure_key0;   /*!< (@ 0x00000050) Non-Fixed Non-Secure Key Register0                         */

